In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([[2.4, np.nan],
                    [6.3, -5.4],
                    [np.nan, np.nan],
                    [0.75, -1.3]],
                    index=list("abcd"),
                    columns=["one","two"])
df

    one  two
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

In [4]:
df.sum()

one    9.45
two   -6.70
dtype: float64

In [5]:
df.mean(axis=1)

a    2.400
b    0.450
c      NaN
d   -0.275
dtype: float64

In [6]:
df.idxmax()

one    b
two    d
dtype: object

In [8]:
df.idxmin(axis=1)

/var/folders/yz/s57wsyt918j04kt6btpgwgy40000gn/T/ipykernel_46872/1008769922.py:1: FutureWarning: The behavior of DataFrame.idxmin with all-NA values, or any-NA and skipna=False, is deprecated. In a future version this will raise ValueError
  df.idxmin(axis=1)

a    one
b    two
c    NaN
d    two
dtype: object

In [9]:
df.idxmin()

one    d
two    b
dtype: object

In [10]:
df

    one  two
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

In [11]:
df.cumsum()

    one  two
a  2.40  NaN
b  8.70 -5.4
c   NaN  NaN
d  9.45 -6.7

In [12]:
df

    one  two
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

In [13]:
df.corr()

     one  two
one  1.0 -1.0
two -1.0  1.0

In [14]:
df.cov()

         one      two
one   8.1225 -11.3775
two -11.3775   8.4050